app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Star Wars' LIMIT 1
---
	def find_similar_movies
		@movies = Movie.find_director_movies(params[:title])